{
  "title":"Brisage de glace : rencontre des géniales gens",
  "url":"https://www.thehackingproject.org/fr/dashboard/courses/4/lessons/294",
  "signature":"4405556389424487679",
  "subheadings":[
    "1. Introduction",
    "2. C'est parti",
    "2.1. Questions pour des futurs champions",
    "2.2. Loto, à toi le tour",
    "2.3. 2 vérités 1 mensonge",
    "2. C'est la fin ! C'est aussi le début"
  ],
  "contents":[
    "Afin de t'aider à faire tes premières rencontres, nous allons te demander de faire des petits icebreakers avec les membres de la chaîne vocale que tu as rejointe.",
    "Ce sera un parfait moment pour apprendre à rencontrer les premiers co-moussaillons et tu auras au moins un premier groupe de personnes avec lesquelles tu pourras commencer à interagir.",
    "Pas besoin de passer 300 ans à trouver LA chaîne vocale parfaite : les relations se feront au fur et à mesure de la formation, des apéros que vous organiserez entre vous, des corrections de pairs, des sessions de travail en présentiel, des passions, des affinités. L'objectif est que tu aies tes premiers repères pour ces premiers instants.",
    "Voici la liste des jeux à faire avec ton équipe :",
    "Un jeu basé sur des questions perso, qui te permettra de découvrir des personnes",
    "Un jeu où vous allez gagner des millions",
    "Un jeu de vérités et de mensonges ;)",
    "Ces jeux durent au total entre une heure ou deux et nécessitent que tu ailles dans une chaîne vocale avec d'autres personnes.",
    "Pour commencer, va dans une chaîne vocale qui te met à l'aise. C'est parti !",
    "Commençons par des questions. Une personne du groupe va partager son écran et aller sur ce site. Le groupe doit prendre une personne au hasard (ex : la personne la plus jeune). Cette personne va devoir répondre à la question montrée sur l'écran. Puis une fois que la personne a répondu à la question, elle va choisir une autre personne, rafraichir la page. La personne choisie va devoir répondre à la question.",
    "Réitérer pendant 20 minutes.",
    "Prenez chacun 5 minutes pour imaginer ce que vous feriez si vous gagniez 25m€ au loto. Écris autant de choses que possible.",
    "Puis discutez chacun de vos choix.",
    "Un membre du groupe va écrire 3 déclarations à propos de lui : deux seront vraies, et une sera fausse. Les autres membres vont voter pour savoir laquelle est fausse.",
    "Une fois que tout le monde a voté, la personne concernée va annoncer quelle déclaration est fausse.",
    "Faites le tour du groupe jusqu'à ce que tout le monde ait joué.",
    "La personne ayant trouvé le plus de mensonges a gagné un bon point.",
    "Alors, c'était marrant quand même avoue ! J'espère que tu as pu tisser tes premiers liens :)",
    "Si ce n'est pas le cas, bah il te reste plusieurs centaines d'autres personnes avec qui ça pourra le faire.",
    "Maintenant que tu as fait tout ça, il ne te reste plus qu'à attaquer les cours, et le projet. Bon courage 😊"
  ]
}