{
  "title":"HTML / CSS : la mise en page",
  "url":"https://www.thehackingproject.org/fr/dashboard/courses/4/lessons/297",
  "signature":"-1583229454533778642",
  "subheadings":[
    "1. Introduction",
    "2. Historique",
    "3. La ressource",
    "3.1. Apprendre FlexBox",
    "3.2. Récap sur FlexBox",
    "⚠️ ALERTE ERREUR COMMUNE",
    "⚠️ ALERTE ERREUR COMMUNE",
    "4. Points importants à retenir",
    "🚀 ALERTE BONNE ASTUCE",
    "5. Pour aller plus loin"
  ],
  "contents":[
    "Les MotherFuckingWebsites c'est bien, mais comment organiser une page web complexe avec un header, un footer, des éléments centrés, des sections ? Il est temps d'apprendre à utiliser FlexBox en CSS, le nouveau standard pour mettre en page son site web !",
    "CSS (Cascading Style Sheets) est sorti au milieu des années 90, avec une technique révolutionnaire de mise en page par cascade*. C'est rapidement devenu le langage universel pour habiller une page web. L'outil FlexBox a été implémenté dans CSS3 (vers 2009), puis s'est peu à peu imposé sur l'ensemble des navigateurs jusqu'à devenir l'outil privilégié pour placer les éléments d'une page HTML.",
    "*Cascade : c'est ainsi qu'on appelle la combinaison de différentes sources de styles appliqués à un même document, selon leur degré respectif de priorité. Merci Wikipédia !",
    "Cette fois, nous allons te demander de continuer le cours HTML / CSS de OpenClassrooms à partir de là où tu t'étais arrêté. Avance dans la track HTML / CSS de OpenClassrooms jusqu'à la partie \"Mise en page avec FlexBox\" inclue.",
    "Maintenant que tu as compris comment marche FlexBox, nous te proposons de pratiquer avec un jeu : FlexBox Froggy. C'est un excellent exercice pour t'entraîner à la mise en forme avec FlexBox.",
    "FlexBox est maintenant LA référence en CSS pour centrer des éléments, les répartir en hauteur ou en largeur, etc. Pour ceux qui avaient déjà pratiqué le CSS auparavant, évitez au maximum les inline-block ou autre float. FlexBox doit être privilégié car compatible avec tous les navigateurs récents et son rendu est plus uniforme quelle que soit la taille des écrans (de l'écran plat jusqu'au smartphone).",
    "Pour mettre en place FlexBox, rien de plus simple ! Crée un élément HTML (par exemple une div) contenant les autres éléments à aligner en FlexBox. Exemple :",
    "Dans l'exemple ci-dessus, rajoute à la div contenant l'id conteneur les propriétés CSS suivantes :",
    "Applique FlexBox à tous ses éléments enfants (ou children) avec le CSS display: flex;",
    "Choisis l'axe d'alignement des children : soit en ligne (mode par défaut) avec flex-direction: row;, soit en colonne avec flex-direction: column;",
    "Choisis ensuite comment les éléments doivent se répartir sur cet axe :\nTous rassemblés au début avec justify-content: flex-start;?\nTous rassemblés à la fin avec justify-content: flex-end;?\nTous centrés avec justify-content: center;?\nRépartis sur l'axe, sans marge, avec justify-content: space-between;?\nRépartis sur l'axe, avec marge, en utiliant justify-content: space-around;?",
    "Tous rassemblés au début avec justify-content: flex-start;?",
    "Tous rassemblés à la fin avec justify-content: flex-end;?",
    "Tous centrés avec justify-content: center;?",
    "Répartis sur l'axe, sans marge, avec justify-content: space-between;?",
    "Répartis sur l'axe, avec marge, en utiliant justify-content: space-around;?",
    "Enfin, choisis si tu souhaites aussi aligner tes éléments sur l'autre axe (horizontalement ou verticalement) avec la commande align-items: *qqch*;",
    "Si tu veux répartir horizontalement tes éléments avec FlexBox, pas de souci : le navigateur va utiliser toute la largeur disponible sur l'écran. Par contre, pour les répartir verticalement, tu dois absolument spécifier une hauteur à l'élément conteneur (ex : height: 100px;). Sans ça, tes justify-content: center ou justify-content: space-around n'auront aucun effet verticalement !",
    "Je te vois venir avec tes MAIS POURQUOI ? Et bien gros malin, c'est tout simplement parce qu'on peut scroller sur un site web. Quand on dit au navigateur \"centre-moi ces éléments verticalement\", s'il ne sait pas sur quelle hauteur il travaille, comment trouver le centre ? 😘",
    "Quand tu ajoutes un display:flex; à un élément, FlexBox est appliqué uniquement aux éléments correspondant à ses enfant directs. Les \"petits-enfants\" ou autres n'ont pas FlexBox.",
    "FlexBox est un outil puissant pour placer où l'on veut un élément sur une page HTML, mais qui nécessite un peu de pratique pour bien le comprendre. N'hésite pas à jeter un oeil à la page W3school sur le sujet afin de visualiser rapidement le code CSS utilisant FlexBox et son résultat sur une page HTML.",
    "Bosser en FlexBox, c'est pas simple : on change le CSS, on rafraîchit le navigateur, les éléments bougent mais on sait pas trop comment ni pourquoi...",
    "Pour faciliter la lisibilité de tout ça, mets temporairement des bordures à tous tes éléments en leur appliquant une class= \"border-flex\" à laquelle tu vas appliquer le CSS suivant (au format \"border: *épaisseur_de_bordure* *style_de_bordure* *couleur_de_bordure*\") :",
    "La présence de ces bordures va légèrement décaler tes éléments (elles font quelques pixels) mais c'est super pour voir quelle taille fait chaque élément, où il se place, qui est centré sur quoi, etc.",
    "Pas besoin de passer des années dessus, mais tu peux finir le cours de OpenClassrooms sur HTML / CSS si tu veux être un champion du Front !",
    "Tu peux aussi faire la suite de FlexBox Froggy (Grid Garden) qui te présente la notion de FlexGrid.",
    "Enfin, on aime beaucoup la vidéo tuto du corsaire Kleber qu'il a faite afin de vous montrer quelques bases de mise en forme."
  ]
}