{
  "title":"Introduction à Discord",
  "url":"https://www.thehackingproject.org/fr/dashboard/courses/4/lessons/380",
  "signature":"-3313226014333591035",
  "subheadings":[
    "1. Introduction",
    "2. Historique et contexte",
    "3. La ressource",
    "3.1. Tutoriel",
    "3.2. Chaînes vocales",
    "🤓 QUESTION RÉCURRENTE",
    "3.3. Création d'affinités",
    "3.4. Création de serveurs Discord alternatifs",
    "4. Points importants à retenir"
  ],
  "contents":[
    "Nous allons te montrer comment nous nous servons de Discord.",
    "Discord est un logiciel de messagerie instantané créé en 2015. En 2019, l'entreprise revendique plus de 250 millions d'utilisateurs et est valorisée à 2 milliards de dollars.",
    "Discord est un outil principalement utilisé pour animer des communautés de joueurs de jeux vidéo, mais est de plus en plus utilisé dans d'autres communautés. Sa gestion des rôles est excellente et dépasse de très loin ce que peut proposer son principal concurrent (Slack) à ce niveau.",
    "Discord excelle aussi pour la gestion de chaînes vocales, quasiment aussi performantes que celles de Zoom (leader mondial de la visio en entreprise), que tu vas beaucoup utiliser à The Hacking Project.",
    "Jusqu'à avril dernier, The Hacking Project utilisait exclusivement Slack. Depuis la session du printemps 2020 (avec le confinement), nous avons décidé de profiter de l'interface de gestion de communauté de Discord, ainsi que de ses chaînes vocales. L'essayer c'est l'adopter et Discord est maintenant notre outil principal pour la gestion de la communauté des moussaillons.",
    "Cette ressource sera en deux parties :",
    "la première est le tutoriel de Discord",
    "la seconde est notre invitation à rejoindre une chaîne vocale",
    "Discord est un outil qui peut être difficile à appréhender, surtout au début. Afin que tout se passe bien pour toi, nous avons fait un tutoriel qui explique comment le rejoindre et quelles sont nos règles. Je t'invite à le suivre scrupuleusement, même si tu as déjà rejoint notre Discord.",
    "Il est indispensable que tu rejoignes le Discord : toute la communauté s'y retrouve et discute du cursus. Sans ce Discord, tu n'auras presque aucune chance de réussir The Hacking Project. Nous t'invitons à y aller.",
    "Coder seul dans son coin n'est pas chose aisée. Nous avons donc créé des chaînes vocales afin que tu puisses discuter avec d'autres personnes. Ces chaînes vocales te permettront de trouver du lien facilement.",
    "Ainsi, nous avons créé une foultitude de chaînes vocales dédiées afin que vous puissiez discuter entre moussaillons. Si tu ne rejoins pas de personne en présentiel, nous nous attendons à ce que tu sois en permanence dans l'une de ces chaînes. Sans groupe (physique ou en vocal), tu ne profites pas à fond du peer-learning et tu te pénalises dans ton apprentissage au code. THP est intense et ce sont les moussaillons soudés qui permettront à tout le monde de réussir. Après, tu es une grande personne, tu fais ce que tu veux. Nous te donnons juste les armes pour que tu puisses réussir.",
    "Voici quelques règles pour les chaînes vocales :",
    "Tu peux rejoindre et partir à ta guise : l'objectif est que tu tombes avec des gens sympa avec lesquels tu as envie de parler",
    "Si jamais tu commences à avoir des affinités avec certaines personnes, vous pouvez tout à fait vous donner rendez-vous dans une chaîne vocale précise. Ajoutez-vous en tant qu'ami sur Discord : rencontre des gens et éclate-toi !",
    "Quand tu rentres dans une chaîne : présente-toi et dis bonjour ! THP est une formation communautaire. Si tu viens dans une chaîne vocale juste parce que \"on te l'a dit\", en désactivant micro et son, ce n'est pas cool pour le groupe que tu as rejoint.",
    "Si tu ne te sers pas de la chaîne vocale, quitte-la ! Ce n'est pas cool de prendre un spot qui aurait pu servir à quelqu'un dautre",
    "Utilisez un maximum ces chaînes pour faire du lien et appropriez-vous les : elles sont très pratiques et vous serviront à vous dépasser",
    "Discord propose un outil de \"live\" où tu peux partager ton écran avec d'autres personnes dans la chaîne vocale. Plutôt pratique pour expliquer son code à la volée.",
    "Enfin, la gestion du micro et du son. C'est une question épineuse. Voici nos conseils :",
    "il faut voir ces chaînes vocales comme d'excellents remplacements à une présence physique, donc couper le micro en permanence n'est peut être pas la meilleure solution",
    "l'objectif est que tu discutes avec les gens comme s'ils étaient à côté, et si tu dois activer ton micro pour ceci, cela ajoute une étape en plus. Ceci te fera moins parler que si tu activais ton micro en permanence",
    "si jamais tu es es dans une pièce où tu ne peux pas parler librement, tu peux couper et réactiver ton micro à ta guise, le tout en accord avec ton groupe bien entendu",
    "de base, rentrer dans une chaîne vocale avec le micro coupé sans se présenter n'est pas très bien vu : soyez humain :)",
    "enfin, en ce qui concerne le son, et bien si tu rentres dans une chaîne vocale en coupant son et micro, pourquoi es-tu entré dans cette chaîne vocale ? ;)",
    "Mais dis-donc Jamy, quand je rejoins une chaîne les gens parlent de trucs trop avancés pour moi et je n'ose pas les déranger !",
    "THP est une formation qui est orientée vers la communauté et le peer-learning. C'est tout à fait normal d'être à un niveau moins avancé que d'autres et donc de devoir demander de l'aide. C'est d'ailleurs assez mal vu de voir des gens qui finissent à 15h et qui en profitent pour s'en aller au lieu d'aider les autres. Si tu n'oses pas demander parce que tu as \"peur de passer pour un boulet\", tu vas t'auto-censurer, tu vas prendre plus de retard, tu vas encore plus t'auto-censurer, et dans deux jours tu quitteras la formation. Et nous ne voulons pas cela pour toi. Donc arrête de penser que tu es une personne plus lente que les autres et n'hésite pas à demander. Et si tu tombes dans une chaîne avec des gens pas cools, bah tu n'as qu'à partir et trouver d'autres personnes sympa !",
    "Bien entendu, ces règles doivent être en accord avec les règles de notre Discord. Nous avons une tolérance 0 envers toute forme de harcèlement et les fautifs se feront exclure.",
    "Avec l'outil de Discord, nous t'avons donné les armes pour te créer des affinités en fonction des passions, de ta région, ou au feeling ! Avec ceci, tu peux facilement créer (si tu en as envie) un groupe de travail, commencer à le rejoindre en physique (ou pas) ou aller plus loin dans les interactions.",
    "L'objectif est que tu te sentes le plus à l'aise avec la communauté et que tu te crées des affinités pour réussir au mieux la formation :)",
    "Lors des précédentes sessions, quelques personnes inspirées ont créé des serveurs Discord alternatifs. D'ordre général, nous aimons que les élèves prennent des initiatives et nous n'avions pas d'opinion à ce sujet là. Cependant, nous avons demandé à plusieurs reprises aux membres de la communauté ce qu'ils pensaient des serveurs alternatifs. La réponse était unanimement négative. En effet, les serveurs Discords alternatifs :",
    "dispersaient trop la communauté",
    "empêchaient tout le monde d'avoir les liens pépite au bon moment",
    "donnaient l'impression que le Discord principal est vide",
    "pénalisaient les personnes qui n'avaient pas les liens",
    "Suite à cette demande des membres de la communauté, nous avons décidé de ne pas soutenir les serveurs alternatifs et nous allons vous demander de ne pas en créer. L'objectif est que tout le monde passe un agréable moment à THP, donc en créer un serait contraire à cet objectif.",
    "Bon, on ne peut pas vous fliquer (et ce n'est pas le but de la formation) donc on fera cette règle à la confiance : les seuls juges seront toi, ton miroir, et ta déontologie (et potentiellement quelques personnes de la communauté). Cependant, sache que c'est une requête demandée unanimement par la communauté, donc ne pas la respecter ne serait pas cool envers les personnes qui en ont fait la demande.",
    "Si jamais tu vois des personnes commencer à proposer des serveurs Discord alternatifs, je t'invite à ne pas y aller et leur rappeler que pour le bien de la communauté, nous ne soutenons pas cela.",
    "Suis le tutoriel de notre Discord. Approprie-toi l'outil : il te sera indispensable pour la formation.",
    "Sois en permanence dans une chaîne vocale."
  ]
}