{
  "title":"Le peer-learning mis à exécution dans THP : à quoi s'attendre ?",
  "url":"https://www.thehackingproject.org/fr/dashboard/courses/4/lessons/310",
  "signature":"-4189108377388381818",
  "subheadings":[
    "1. Introduction",
    "2. La ressource",
    "2.1. La méthodologie du \"learning by doing\"",
    "⚠️ ALERTE ERREUR COMMUNE",
    "2.2. La méthodologie du peer learning",
    "2.3. Chercher, et trouver l'information",
    "2.4. Chercher et trouver de l'aide",
    "2.4.1. Lire l'erreur",
    "2.4.2. Chercher sur Google",
    "2.4.3. Demander de l'aide !",
    "⚠️ ALERTE ERREUR COMMUNE",
    "2.4.3.1. Structure d'une bonne question",
    "2.4.3.2. Exemple d'une question bien posée",
    "3. Points importants à retenir"
  ],
  "contents":[
    "The Hacking Project est une formation qui va te faire penser autrement et apprendre d'une autre façon. Ok c'est cool ! Mais de quoi s'agit-il exactement ? Avant de commencer, laisse-moi donc te mettre un peu dans l'ambiance et t'expliquer notre état d'esprit.",
    "The Hacking Project croit en une chose : c'est en faisant que l'on apprend. Plutôt que de vous donner des cours où vous ne retiendrez même pas la moitié, nous préférons vous laisser chercher l'info vous-même et vous faire apprendre par la pratique, via de longs projets. Nous avons remarqué qu'avec l'avènement des smartphones et de la connaissance disponible en deux clics sur Google, les personnes qui réussiront le tournant de la révolution technologique seront celles qui savent dénicher la bonne info au bon moment, plutôt que celles qui retiennent par coeur les cours donnés.",
    "La pédagogie de The Hacking Project répond exactement à cette réalisation. En vous donnant peu de cours et une focalisation sur les projets, vous serez obligés de passer du temps à fouiller le net, puis comparer les différentes théories pour choisir la plus adaptée à votre besoin. Ainsi, plutôt que de vous demander bêtement de faire un SWOT, vous devrez réfléchir en dehors de la boite pour découvrir la meilleure méthode marketing. Vous serez donc amenés à chercher vous-mêmes les réponses à vos questions. Évidemment, au début ça fait bizarre... Mais après quelques jours, ça viendra naturellement. Et croyez-moi, cette compétence vous servira toute votre vie. Elle vous aidera à remettre en question beaucoup de choses, et surtout, à ne pas être un mouton.",
    "Attention ! Retiens bien cette information qui te servira durant tout le parcours THP et est l'une des principales raisons d'abandon des moussaillons de The Hacking Project.",
    "The Hacking Project est une schola enseignant via l'apprentissage par projets. Ainsi, il est fortement déconseillé de passer plus de 20mn sur une ressource avant d'attaquer le projet du jour. Parcours la ressource pour voir de quoi elle parle, fais les projets, et utilise les ressources en support pour réaliser le projet. Comprendre des concepts nouveaux sans mettre les mains dans le cambouis est beaucoup plus difficile que de comprendre en lisant. Je vois moultes moussaillons qui \"veulent bien comprendre avant de passer au projet du jour\" en pensant bien faire, car l'école traditionnelle leur a enseigné cela. Parmi ces personnes, jamais une n'a fini THP, et je ne plaisante pas.",
    "L'objectif n'est pas de foncer tête baissée et faire le projet en ne comprenant rien, mais de comprendre que la ressource possède des notions qui te serviront lors du projet, et qu'en faisant, tu comprendras bien mieux cette dernière. Toutes les notions de par coeur, de telle méthode fait cela, est déléguée à Google qui est bien plus fort que toi pour le par coeur. La valeur ajoutée d'un travailleur moderne est l'utilisation de l'information donnée par Google pour en faire des projets complexes.",
    "Donc si jamais tu vois quelqu'un qui est encore en train d'essayer de \"bien comprendre la ressource du jour\" alors que l'on est au milieu de la journée, donne-lui cette ressource et dis-lui qu'elle comprendra bien mieux en faisant un projet concret qu'en essayant de relire une énième fois une notion abstraite. Vraiment, il en va de la réussite ou l'échec de cette personne.",
    "The Hacking Project possède une autre maxime : \"c'est en enseignant que l'on apprend\". En constatant que les meilleures écoles de code françaises reposent sur le fait de ne pas avoir de professeur (42, Epitech), nous en avons déduit que :",
    "Être en groupe avec d'autres élèves vous permet de vous expliquer mutuellement les concepts difficiles avec vos propres mots. Le processus d'apprentissage se fait en groupe, exactement comme dans le monde du travail.",
    "Le fait de ne pas avoir de professeur pour vous donner la solution vous enseigne l'humilité : non seulement vous savez pertinemment que ce que vous rendez peut être amélioré, mais en plus vous pouvez vous rendre compte que la solution parfaite n'existe pas.",
    "À The Hacking Project, ce ne sera pas facile. Nous avons fait exprès de vous donner des projets compliqués pour que vous les fassiez ensemble, en groupe, en communauté. On peut rapidement se décourager par rapport à la difficulté des exercices, mais c'est pour que vous fassiez les projets ensemble, et que vous vous serriez les coudes. Si jamais tu te décourages, sache que d'autres membres sont dans la même galère et ensemble vous réussirez la formation.",
    "The Hacking Projet est une formation qui va vous apprendre une notion fondamentale d'un employé de bureau du XXIème siècle : \"il ne faut pas forcément connaître l'information, mais il faut savoir où la trouver\".",
    "Ainsi, il n'est pas possible de réaliser les projets sans l'aide d'internet, de recherches d'information complémentaires. Internet vous servira à approfondir des notions, à vous débloquer, à vous apporter des notions bonus, et bien d'autres. Au cours de la formation, nous vous donnerons des ressources incomplètes, parfois volontairement, pour vous inciter à sortir de votre zone de confort et à chercher par vous même l'information, et à la partager entre vous. Pourquoi ? Tout simplement car c'est comme ça que ça marche dans la vraie vie, donc autant prendre le pas directement 😃",
    "La plupart des formations vous tendront les solutions sur un plateau d'argent dès que vous serez bloqués plus de 10 secondes (j'exagère à peine), ce qui fait qu'en sortie, vous ne serez bons qu'à appliquer bêtement du code sans avoir de l'autonomie.",
    "Alors oui, cette technique vous fait sortir de votre zone de confort, mais voyez l'énorme avantage à ceci : vous aurez acquis une seconde nature qui fera de vous des personnes à la fois autonomes, curieuses, en quête de savoir, et débrouillardes. Qui ne veut pas travailler avec ces personnes ? 😉",
    "On ne va pas te le cacher : tu seras bloqué. Plus d'une fois. Être bloqué fait partie intégrante de notre processus d'apprentissage et de la vie. Le propre d'une personne est de trouver des solutions à ses problèmes, qu'ils soient personnels, professionnels, ou qu'ils concernent du code qui ne marche pas. Heureusement, trouver de l'aide est possible. En général sur internet, ou dans la communauté.",
    "Voici donc un petit guide pour demander de l'aide à la communauté.",
    "Bien souvent, l'ordinateur nous aide à comprendre les erreurs. Voici un exemple fait avec Ruby, un langage de programmation :",
    "Ici, on peut voir que l'ordinateur n'arrive pas à convertir un integer (nombre entier) en string (chaîne de caractères). On se rend compte aussi que c'est un problème de correspondance : on a voulu additionner une string et un integer entre eux, ce qui fait bugger le code...",
    "Je me sers de Google toutes les 10 minutes quand je code. Parfois, c'est pour combler un trou de mémoire : `how to add an element in array ruby`. D'autres fois, c'est pour résoudre des bugs. Pour reprendre le code ci-dessus, coller cette erreur dans Google me permettrait d'avoir plein de cas similaires où les gens ont voulu additionner des strings à des integer, ainsi que les solutions trouvées.",
    "Des fois, on bloque vraiment beaucoup. Ce n'est pas grave : tu peux demander de l'aide à tes partenaires de groupe, ou bien dans le Discord ! Voici maintenant quelques astuces sur la façon de poser tes questions, ce qui t'aidera à ne pas te retrouver sans réponse :",
    "Il m'arrive de voir des moussaillons qui demandent de l'aide avec un joli message du genre :",
    "Je ne sais pas pour toi, mais quand je vois ce genre de messages, ça ne me donne absolument pas envie de prendre 5 minutes pour aider la personne. Voici les principales erreurs qui ont été commises :",
    "Aucune mise en contexte : je ne sais pas ce que \"sa marche pa\" veut dire. Est-ce que le programme plante ? Est-ce qu'il ne donne pas le résultat voulu ? Sans connaître le contexte, on ne sait pas comment aider. Personnellement je n'ai pas que ça à faire que de reprendre tout son code pour le tester chez moi et comprendre pourquoi \"sa marche pa\".",
    "La personne ne nous dit pas ce qu'elle a fait ou tenté comme solutions. Bien souvent, les réponses sont \"as-tu essayé X ou Y ?\". Difficile de deviner comment la sortir de son pétrin sans un minimum de détails, n'est-ce pas ?",
    "Une photo en horreur absolue : la plupart des gens vont copier-coller l'erreur dans Google et voir avec toi comment t'aider. Si tu leur fournis une capture d'écran -- ou pire, une photo de ton écran (je vous jure que ça arrive, et ce n'est pas si rare) ! -- les gens ne pourront pas faire de copier-coller, et te diront d'aller te faire voir.",
    "Voyons maintenant comment poser une bonne question pour demander de l'aide.",
    "Commence par dire ce que tu comptes faire.\nLa mise en contexte est très importante : que veux-tu faire avec ce programme ? Pourquoi le programme ne répond pas comme tu souhaiterais qu'il te réponde ?",
    "La mise en contexte est très importante : que veux-tu faire avec ce programme ? Pourquoi le programme ne répond pas comme tu souhaiterais qu'il te réponde ?",
    "Précise ce que tu as cherché jusqu'à présent.\nPuisque nous allons prendre du temps pour t'aider, il est important de savoir que tu as aussi pris le temps de chercher et que nous n'allons pas faire un simple copier coller de l'erreur et te donner le premier résultat Google en guise de solution.",
    "Puisque nous allons prendre du temps pour t'aider, il est important de savoir que tu as aussi pris le temps de chercher et que nous n'allons pas faire un simple copier coller de l'erreur et te donner le premier résultat Google en guise de solution.",
    "Donne le code qui ne marche pas.\nDifficile de t'aider sans ça. Pour le code, nous te conseillons de le mettre entre ``` comme montré ici. Pour les bouts de code plus gros, nous te recommandons la création de snippets, ou extraits.",
    "Difficile de t'aider sans ça. Pour le code, nous te conseillons de le mettre entre ``` comme montré ici. Pour les bouts de code plus gros, nous te recommandons la création de snippets, ou extraits.",
    "Donne l'erreur que te renvoie le programme\n90% du temps, la réponse se trouve dans l'erreur. Ce serait donc dommage de ne pas la fournir aussi... Idem que pour les bouts de code, nous conseillons de tout mettre au bon format (avec des ``` ou des snippets/extraits).",
    "90% du temps, la réponse se trouve dans l'erreur. Ce serait donc dommage de ne pas la fournir aussi... Idem que pour les bouts de code, nous conseillons de tout mettre au bon format (avec des ``` ou des snippets/extraits).",
    "Voici un exemple d'une question bien posée sur Slack. Si tu suis cette structure, tout devrait bien se passer :)",
    "Le peer learning peut faire mal à ton cerveau au début. Mais accroche-toi bien, car le jeu en vaut clairement la chandelle !"
  ]
}