{
  "title":"Un environnement de travail : découverte des outils pour coder",
  "url":"https://www.thehackingproject.org/fr/dashboard/courses/4/lessons/295",
  "signature":"3604584020477872118",
  "subheadings":[
    "1. Introduction",
    "2. Historique et contexte",
    "3. La ressource",
    "4. Points importants à retenir",
    "5. Pour aller plus loin"
  ],
  "contents":[
    "En observant des développeurs travailler, tu as peut-être constaté qu'il écrivent souvent leur code sur des logiciels balançant plein de couleurs. Même s'il est aussi possible de coder avec un simple bloc-notes en noir sur blanc, c'est quand même beaucoup moins classe... Nous allons donc te conseiller quelques logiciels (pour que tu puisses te la pêter aussi, et pour t'éviter quelques galères), puis te laisser faire ton choix.",
    "Par \"éditeur de texte\", on désigne en général un logiciel permettant d'écrire du texte brut, sans aucune mise en forme. Par exemple, quand tu ouvres un fichier truc.docx sous word, tu peux exécuter des modifications sur ton texte (taille, orientation...). Quand tu écris du texte sur un éditeur de texte, ce dernier n'enregistrera que le texte. Le plus connu du grand public est le bloc-notes de Windows. Malheureusement, il n'est pas très pratique pour écrire du code... Déjà, le format texte noir sur fond blanc fait mal aux yeux au bout de quelques heures. Ensuite, il lui manque certaines fonctionnalités simples mais évidentes comme \"changer toutes les occurrences d'une suite de caractères par une autre\" (exemple : remplacer \"chat\" par \"chien\" dans tout le fichier). C'est pour cette raison que les éditeurs de texte orientés programmation existent.",
    "Les éditeurs de texte ont connu bien des aventures depuis leur création. Certains sont toujours utilisés, même après 40 ans d'existence. D'autres deviennent des superstars en 5 ans à peine. Il faut voir un éditeur de texte comme un outil, et donc bien réfléchir à celui qui va te correspondre.",
    "D'ailleurs, tout comme la guéguerre \"Android vs. iOS\", il existe des guerres entre les différents éditeurs de texte. La plus connue est la fameuse \"Vim vs. Emacs\" qui a généré des milliers de débats sur l'ancêtre d'Internet. Si aujourd'hui ce débat \"Vim vs. Emacs\" a beaucoup faibli (notamment parce qu'Emacs n'est plus trop utilisé), sa notoriété est devenue une blague reprise par XKCD ou encore la série Silicon Valley.",
    "Pour te donner un aperçu des éditeurs les plus utilisés, Stack Overflow a fait en 2019 un sondage demandant aux développeurs sur quel éditeur ils codaient. Tu peux voir leurs réponses ici.",
    "Nous te recommandons 3 éditeurs de texte :",
    "Sublime Text, dont voici un tutoriel d'introduction.",
    "Atom : Voici un tutoriel d'introduction, ainsi qu'un article écrit par un de nos moussaillons sur les bons Packages à installer.",
    "Visual Studio Code, dont voici le tutoriel.",
    "Ici, tu peux trouver un comparatif des trois.",
    "Bien entendu, tu peux toujours utiliser Vim, qui extrêmement bien réputé et te fera gagner des points lors de tes prochains entretiens. Voici une marche à suivre pour devenir rapidement champion de Vim. Et puisque c'est toi, je te donne aussi un jeu vidéo pour apprendre Vim en t'amusant.",
    "En général, les personnes qui participent à The Hacking Project trouvent leur bonheur dans l'un des trois éditeurs de texte suivants :",
    "Sublime Text",
    "Visual Studio Code",
    "Atom",
    "Si tu veux aller plus loin, nous t'encourageons à t'entrainer sur Vim en explorant les ressources données plus haut."
  ]
}